taxidriver-api/app/controllers/spots_controller.rb

  def index
    @spots = Spot.all
---
SELECT * FROM `spots`